{
    "format": "layers-model",
    "generatedBy": "keras v2.2.4",
    "convertedBy": "TensorFlow.js Converter v1.2.10.1",
    "modelTopology": {
        "keras_version": "2.2.4",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [{
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "batch_input_shape": [null, 64, 64, 1],
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_2",
                        "trainable": true,
                        "filters": 32,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_1",
                        "trainable": true,
                        "pool_size": [2, 2],
                        "padding": "valid",
                        "strides": [2, 2],
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_3",
                        "trainable": true,
                        "filters": 64,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_4",
                        "trainable": true,
                        "filters": 64,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_2",
                        "trainable": true,
                        "pool_size": [2, 2],
                        "padding": "valid",
                        "strides": [2, 2],
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_5",
                        "trainable": true,
                        "filters": 128,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_6",
                        "trainable": true,
                        "filters": 128,
                        "kernel_size": [3, 3],
                        "strides": [1, 1],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_3",
                        "trainable": true,
                        "pool_size": [2, 2],
                        "padding": "valid",
                        "strides": [2, 2],
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_1",
                        "trainable": true,
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "units": 6072,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "units": 3036,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }]
            }
        },
        "training_config": {
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "lr": 9.999999747378752e-05,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "decay": 0.0,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            },
            "loss": "categorical_crossentropy",
            "metrics": ["accuracy"],
            "sample_weight_mode": null,
            "loss_weights": null
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of66.bin", "group1-shard2of66.bin", "group1-shard3of66.bin", "group1-shard4of66.bin", "group1-shard5of66.bin", "group1-shard6of66.bin", "group1-shard7of66.bin", "group1-shard8of66.bin", "group1-shard9of66.bin", "group1-shard10of66.bin", "group1-shard11of66.bin", "group1-shard12of66.bin", "group1-shard13of66.bin", "group1-shard14of66.bin", "group1-shard15of66.bin", "group1-shard16of66.bin", "group1-shard17of66.bin", "group1-shard18of66.bin", "group1-shard19of66.bin", "group1-shard20of66.bin", "group1-shard21of66.bin", "group1-shard22of66.bin", "group1-shard23of66.bin", "group1-shard24of66.bin", "group1-shard25of66.bin", "group1-shard26of66.bin", "group1-shard27of66.bin", "group1-shard28of66.bin", "group1-shard29of66.bin", "group1-shard30of66.bin", "group1-shard31of66.bin", "group1-shard32of66.bin", "group1-shard33of66.bin", "group1-shard34of66.bin", "group1-shard35of66.bin", "group1-shard36of66.bin", "group1-shard37of66.bin", "group1-shard38of66.bin", "group1-shard39of66.bin", "group1-shard40of66.bin", "group1-shard41of66.bin", "group1-shard42of66.bin", "group1-shard43of66.bin", "group1-shard44of66.bin", "group1-shard45of66.bin", "group1-shard46of66.bin", "group1-shard47of66.bin", "group1-shard48of66.bin", "group1-shard49of66.bin", "group1-shard50of66.bin", "group1-shard51of66.bin", "group1-shard52of66.bin", "group1-shard53of66.bin", "group1-shard54of66.bin", "group1-shard55of66.bin", "group1-shard56of66.bin", "group1-shard57of66.bin", "group1-shard58of66.bin", "group1-shard59of66.bin", "group1-shard60of66.bin", "group1-shard61of66.bin", "group1-shard62of66.bin", "group1-shard63of66.bin", "group1-shard64of66.bin", "group1-shard65of66.bin", "group1-shard66of66.bin"],
        "weights": [{
            "name": "conv2d_1/kernel",
            "shape": [3, 3, 1, 32],
            "dtype": "float32"
        }, {
            "name": "conv2d_1/bias",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "conv2d_2/kernel",
            "shape": [3, 3, 32, 32],
            "dtype": "float32"
        }, {
            "name": "conv2d_2/bias",
            "shape": [32],
            "dtype": "float32"
        }, {
            "name": "conv2d_3/kernel",
            "shape": [3, 3, 32, 64],
            "dtype": "float32"
        }, {
            "name": "conv2d_3/bias",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "conv2d_4/kernel",
            "shape": [3, 3, 64, 64],
            "dtype": "float32"
        }, {
            "name": "conv2d_4/bias",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "conv2d_5/kernel",
            "shape": [3, 3, 64, 128],
            "dtype": "float32"
        }, {
            "name": "conv2d_5/bias",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "conv2d_6/kernel",
            "shape": [3, 3, 128, 128],
            "dtype": "float32"
        }, {
            "name": "conv2d_6/bias",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "dense_1/kernel",
            "shape": [8192, 6072],
            "dtype": "float32"
        }, {
            "name": "dense_1/bias",
            "shape": [6072],
            "dtype": "float32"
        }, {
            "name": "dense_2/kernel",
            "shape": [6072, 3036],
            "dtype": "float32"
        }, {
            "name": "dense_2/bias",
            "shape": [3036],
            "dtype": "float32"
        }]
    }]
}
